read_verilog contadores.v
hierarchy -check -top contadores
proc; opt; fsm; opt; memory; opt
techmap; opt
dfflibmap -liberty cmos_cells.lib
abc -liberty cmos_cells.lib
clean
write_verilog contadores_synth.v